<template>
	<view class='content-box'>
		<div class='title'>“{{appName}}”隐私政策</div>
		<div class='content'>
			【审慎阅读】你在开通会员服务过程中点击同意本协议之前，应当认真阅读本协议。
			<span class='point'>
				请您务必审慎阅读、充分 理解各条款内容，特别是免除或者限制责任的条款、法 律适用和争议解决条款。免除或者限制责任的条款将以 粗体下划线标识。你应重点阅读。
			</span>
			如你对协议有任何疑 问，可向{{appName}}客服咨询。
		</div>
		<div class='content'>
			<span class='point'>
				【民事行为能力】您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。如您未满18周岁或者不具备相应的民事行为能力，
				请您在法定监护人的陪同下阅读本服务协议，并在进行注册、下单、支付等任何行为或使用“{{appName}}平台其他任何服务前，应事先征得您法定监护人的同意。
			</span>
		</div>
		<div class='content'>
			<span class='point'>
				[签约动作]当您按照注册页面引导勾选同意本协议且完 成全部注册程序后，即表示您已充分阅读、理解并接受 本协议的全部内容，
				并与“{{appName}}”平台达成一致，成为 “{{appName}}”平台的“用户”。在阅读本协议的过程中，如 果您不同意本协议或其中任何条款约定，您应立即停止 注册程序。
			</span>
		</div>
		<div class='content'>
			<div class='item-title'> 一、概述 </div>
			<div class='item'>第一条：本服务协议双方为{{company}}旗下平台“{{appName}}”(下称“{{appName}}”)与“{{appName}}”
				平台用户(下称“用户”或“您”)，本服务协议具有合同效力。</div>
			<div class='item'>
				第二条：“{{appName}}”由{{company}}实际运营和管理的，为满足消费者个人生活消费需求而建立的，
				名为{{appName}}(域名为{{domain}})的电子商务平台， 其形式包括但不限于{{appName}}微信小程序及未来可能开发产生的其他形式，本协议中或称“本平台”。
			</div>
			<div class='item'>
				第三条：根据国家法律法规变化、运营需要或为提升服务质量的目的，“{{appName}}“将在必要的时候对上述各项协议、
				条款与规则进行修改更新，并通过在网页或移动客户端上发出公告、通知等合理、醒目的方式向您进行提前通知。
				您应当及时查阅并了解相关更新修改内容，如您不同意相关更新修改内容，可停止使用相关更新修改内容所涉及的服务，
				此情形下，变更事项对您不产生效力；如您在上述更新修改内容实施后继续使用所涉及的服务，将视为您已同意各项更新修改内容。
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 二、定义 </div>
			<div class='item'>
				第四条：“{{appName}}”的用户：用户为具备完全民事行为能力的自然人。无民事行为能力人、限制民事行为能力人不当注册为“{{appName}}”用户或超过其
				民事权利或行为能力范围从事交易的，其与“{{appName}}“之间的服务协议自始无效，“{{appName}}”一经发现，有权立即注销该账号，并追究其使用“{{appName}}”“服务"的一切法律责任。
			</div>
			<div class='item'>
				第五条：用户注册是指用户登录“{{appName}}“平台，并按要求填写相关信息并确认同意履行相关服务协议的过程。用户因进行交易，获取订购商品的有偿服务或硬件、软 件、
				服务及其他方面的费用均由用户负责支付。“{{appName}}“平台仅作为网上订购的交易平台。
			</div>
			<div class='item'>
				第六条：个人信息：以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
			</div>
			<div class='item'>
				第七条：个人敏感信息：指包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下(含)儿童信息等个
				人信息，本隐私权政策中个人敏感信息将以粗体进行显著标识
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 三、我们如何收集和使用您的个人信息 </div>
			<div class='item'>
				本隐私政策中涉及的个人信息主要包括：基本信息(包括个人姓名、生日、性别、收货地址、个人电话号码)；网络身份标识信息(包括系统账号、
				IP地址及与前述有关的密码、口令、口令保护答案)；个人财产信息 (包括交易和消费记录及积分、优惠券)；个人上网记录 (包括网站浏览记录、
				软件使用记录、点击记录、收藏列表等)；个人常用设备信息(包括硬件型号、设备MAC地址、操作系统类型、软件列表、设备标识符，如 IMEI/Android ID/MAC/SIM卡/IMSI信息等
				在内的描述个人设备基本情况的信息) ； 个人位置信息(包括精准定位信息、经纬度等)。
			</div>
			<div class='item'>
				本隐私政策中涉及的个人敏感信息包括：
				<span class="point">
					您的个人财产信息(包括交易和消费记录及积分、优惠券)；其他信息(包括网页浏览记录、精准定 位信息)。
				</span>
			</div>
			<div class='item'>
				(一)您须授权我们收集和使用您个人信息的情形我们的产品或服务包括一些核心功能，包含实现网上购物所必须的功能及保障交易安全所必须的功能。
				我们可能会收集、保存和使用下列与您有关的信息才能实现上述这些功能。如果您不提供相关信息，您将无法正常使用我们提供的产品或服务。
				这些功能包括： <br />
				1、会员服务 <br />
				1.1.基础会员服务 您需要先注册个{{appName}}会员账户成为{{appName}}用户。当您 注册时，您需要向我们提供您本人的手机号码，我们将通过发送短信的方式来通知您关于中奖相关的信息。
				如果您拒绝提供本人手机号，您将无法收到中奖信息。我们可能经您同意后向第三方共享您的账户信息(如头像、昵称及其他经您同意共享的信息)，使您可以实现第三方账户的登录
				及第三方账户与您{{appName}}会员账户的权益互通。<br />
				1.2附加会员服务您可以自行修改补充您的昵称、头像、性别、生日、兴趣爱好以及您的实名认证相关信息，这些信息均属于您的“账户信息”。您补充的账户信息将有助于我们为您提
				供个性化的商品推荐和更优的购物体验，但如果您不提供这些补充信息，不会影响您网上购物的基本功能。 <br />
				2、商品、服务信息的展示为了帮助您找到你所需的商品或服务，避免您重复输入，并提供商品或服务信息展示的最优方式，我们会收集和使用您在访问{{appName}}时的包含浏览、搜索、
				购物车、分享记录在内的服务日志信息、设备信息，提取您的偏好特征。其中：设备信息包括常用设备标识 符(IMEI、Android ID、MAC、IMSI及其他设备识别类 信息)、设备参数及
				系统信息(设备类型、操作系统、设备型号、浏览器类型、语言设置、分辨率及其他硬件相关信息)、应用信息(应用程序版本、应用安装列表及其 他应用相关信息)，根据您的具体操作
				还可能包括设备所在位置相关信息或设备网络环境信息(您授权的GPS位置及/或IP地址、WLAN接入点、蓝牙和基站等传感器信息和服务提供商网络ID(PLMN))。服务日志信息包括浏览记
				录、点击查看记录、搜索查询记录、添加至购物车、交易、售后、分享信息、发布 信息，以及IP地址、浏览器类型、电信运营商、使用语言、访问日期和时间。 <br />
				3、下单及订单管理当您在我们的产品及/或服务中订购具体商品及/或服务时，我们会通过系统为您生成购买该商品及/或服务的订单。在下单过程中，您需至少提供您的收货人姓名、
				收货地址、收货人联系电话。 您可额外填写/选择包括履约时间、其他联系电话在内的更多附加信息以确保商品或服务的准确送达。 同时该订单中会载明您所购买的商品及/或服务信息、
				具体订单号、订单创建时间、履约方式、您应支付的金额。我们收集这些信息是为了帮助您顺利完成交易、保障您的交易安全、便于您查询订单信息、提供客服与 售后服务及其他我们明
				确告知的目的。您可以通过{{appName}}为其他人订购商品及/或服务，您需要提供该实际订购人的前述个人信息，并确保已取得其他人的同意。上述所有信息构成您的“订单信息”，我们收集
				这些信息是为了帮助您通过身份核验、顺利完成与商家的交易、获得配送服务等并方便您查询订单以及为您提供客服咨询与售后服务；我们还会使用您的订单信息来判断您的交易和账户行
				为是否存在异常风险，保护您及其他消费者的财产安全。 <br />
				4、支付；在您下单后，您可以选择与{{appName}}合作的第三方支付机构 (包括微信支付、银联、支付宝等支付通道，以下称“支 付机构")所提供的支付服务。支付功能本身并不收集您的个
				人信息，但我们需要将您的订单号与交易金额信息等订单支付相关信息、订单安全相关设备信息及其他反洗钱法律要求的必要信息，通过在应用程序中嵌入的支付机构软件工具开发包(简称"SDK")
				等方式与与这些支付机构共享，以实现其确认您的支付指令并完成支付。 <br />
				5、交付产品或服务为保证您购买的商品或服务能够顺利、安全、准确送达 或交付，我们会向为{{appName}}提供供应链解决方案的关联方或与{{appName}}合作的第三方配送公司(包括顺丰、达达达等，
				以下称“配送公司”)披露订单相关的配送信息。您知晓并同意，相应物流服务主体会在上述环节内不可避免地获知、使用您的订单信息以保证您的订购的商品能够安全送达。 为使我们及时获悉并
				确认交付进度及状态，向您提供售 后与争议解决服务，您同意我们可自物流相关服务主体 处收集与交付进度相关的信息。<br />
			</div>
			<div class='item'>
				(二)您可自主选择提供的个人信息的情形 <br />
				为向您提供更便捷、更优质、 个性化的产品及/或服务，从而提升您在{{appName}}的网上购物体验，我们在向您提供的以下基础功能中的附加服务或扩展功能中可能会收集和使用您的个人信息。
				如果您不提供这些信息并开放相应权限，不会影响您使用{{appName}}的网上购物的基本服务，但您可能无法获得这些附加服务或功能 您带来的用户体验。<br />
				包括： <br />
				(1)基于位置信息的个性化推荐功能：我们会收集您的位置信息(我们仅收集您当时所处的地理位置，但不会将您各时段的位置信息进 行结合以判断您的行踪轨迹)来判断您所处的地点，
				自动为您推荐您所在区域可以购买的商品或服务，比如 向您推荐离您最近的经销商等。 <br />
				(2)基于摄像头(相机)及相册的扩展功能：我们会调 用您的相机，帮助您使用"拍照上传图片“功能，如在提交售后申请时，拍照商品图片作为佐证资料。
				即使您已同意开启相应权限，我们也仅会在您主动点击客戶端内相机图标时获取上述信息。
			</div>
			<div class='item'>
				(三)征得授权同意的例外 <br />
				根据相关法律法规规定，我们在以下情况下收集、使用您的个人信息无需您的授权同意： <br />
				1、与我们履行法律法规规定的义务相关的 <br />
				2、与国家安全、国防安全有关的； <br />
				3、与公共安全、公共卫生、重大公共利益有关的； <br />
				4、与犯罪侦查、起诉、审判和判决执行等有关的； <br />
				5、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； <br />
				6、所收集的个人信息是个人信息主体或监护人自行向社会公众公开的； <br />
				7、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道； <br />
				8、根据您的要求签订合同所必需的； <br />
				9、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障； <br />
				10、为合法的新闻报道所必需的 <br />
				11、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的； <br />
				12、法律法规规定的其他情形 <br />
			</div>
			<div class='item'>
				(四)我们从第三方获得您个人信息的情形 <br />
				我们可能从第三方处获取您授权共享的个人信息(如头像、昵称等账户信息及匿名广告标识符、设备参数) 并与您的{{appName}}会员账户进行绑定或关联，使您可以通过
				第三方账户直接登录、使用我们的产品或服务或实现账户之间的权益互通。届时，我们将严格按照您明示同意的范围获取相关信息，并依据与第三方的约定、对个
				人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。我们会 使用不低于我们对自身用户个人信息同等的保护手段与
				措施对间接获取的个人信息进行保护。
			</div>
			<div class='item'>
				(五)您个人信息使用的规则 <br />
				1、我们会根据本隐私政策的约定并为实现我们的产品或服务功能对所收集的个人信息进行使用。若我们 将信息用于本隐私权政策未载明的其他用途，或者将基于特定目的
				收集而来的信息用于其他目的，均会事先获得您的明示同意。 <br />
				2、请知悉，根据适用的法律，若我们对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，或我们可能会对收 集的信息
				进行去标识化地研究、统计分析和预测，用于 改善{{appName}}的内容和布局，为商业决策提供产品或服务支撑，以及改进我们的产品和服务(包括使用匿名数 据进行机器学习或
				模型算法训练)，则此类处理后数据的使用无需另行向您通知并征得您的同意。 <br />
				3、若您提供的信息中含有其他用戶的个人信息，在向{{appName}}提供这些个人信息之前，您需确保您已经取得合法的授权。 <br />
				4、我们会对我们的产品或服务使用情况进行统计， 并可能会与公众或第三方共享这些统计信息，以展示我们的产品或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。 <br />
				5、当我们展示您的个人信息时，我们会采用包括内容替换、匿名处理方式对您的信息进行脱敏，以保护您的信息安全。
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 四、我们如何共享、转让、公开披露您的个人信息 </div>
			<div class='item'>
				(一)共享 <br />
				1、我们不会与{{appName}}服务提供者以外的任何公司、组织和个人共享您的个人信息，但以下情况除外： <br />
				(1)事先获得您明确的同意或授权； <br />
				(2)根据适用的法律法规、法律程序、行政或司法要求或诉讼、争议解决所必须的情况下进行提供； <br />
				(3)在法律法规允许的范围内，为维护我们自身及我们的关联方或合作伙伴、您或其他{{appName}}用户或社会公众利益、财产或安全免遭损害而有必要提供； <br />
				(4)只有共享您的个人信息，才能为您提供您需要的产品或服务，如我们必须将您的订单信息与交易有关的必要信息与第三方商家共享来实现您向其购买商
				品或服务的需求，并促使其可以完成后续的售后服务，或者我们必须与物流服务提供商共享您的订单信息才能安排送货，又或者我们需要将您的订单号和订
				单金额与第三方支付机构共享以实现其确认您的支付指令并完成支付等。<br />
				(5)应您需求为您处理您与他人的纠纷或争议； <br />
				(6)符合与您签署的相关协议(包括在线签署的电子协议以及相应的平台规则)或其他的法律文件约定所提供 <br />
				(7)基于学术研究而使用；<br />
				(8)基于符合法律法规的社会公共利益而使用。 <br />
				2、
				<span class="point">
					为便于我们基于{{appName}}账戶向您提供产品和服务，推荐您可能感兴趣的信息，识别会员账戶异常，保护我们关联公司或其他用戶或公众的人身财产安全免遭侵
					害，我们可能会将您的个人信息与我们的关联方或其指定的服务商共享。
				</span>
				但我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。
				<span class="point">
					如我们共享您的个人敏感信息，或我们的关联方要改变个人信息的处理目的，将再次征求您的授权同意。
				</span>
			</div>
			<div class='item'>
				(二)转让 <br />
				我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外： <br />
				1、获得您明确的同意或授权；<br />
				2、根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供； <br />
				3、在涉及合并、收购、破产清算、资产转让或类似情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则，
				我们将要求该公司、组织重新向您征求授权同意。 <br />
			</div>
			<div class='item'>
				(三)公开披露 <br />
				我们仅会在以下情况，且采取符合业界标准的安全防护措施的前提下，公开披露您的个人信息： <br />
				1、获得您明确同意或基于您的主动选择，在您同意的披露方式、范围下披露您所指定的个人信息； <br />
				2、
				<span class="point">
					根据法律法规及相关政策或行政、司法机关要求所必须提供您的个人信息，或您出现严重违反{{appName}}相关协议及规则的情况，或为保护{{appName}}平台用戶或公
					众的人身财产安全免遭侵害的情况下，我们可能会依据所要求的个人信息类型和披露方式公开披露您的个人信息。
				</span>
				当我们收到上述披露信息的请求时，我们会要求必
				须出具与之相应的法律文件，如传票或调查函。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获
				取的数据。在法律法规许可的前提下，我们披露的文件均在加密密钥的保护之下。
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 五、您如何管理您的信息 </div>
			您除了可以按照本政策第二节中的操作路径在我们的客户端上自行操作以外，您还可以通过以下方式访问及管理您的信息：<br />
			<div class='item'>
				 (一)查询、更正和补充您的信息 <br />
				  1、您可进入{{appName}}小程序，个人中心自行查询、更正、 补充您的账户信。 <br />
				  2、通过客服热线联系我们进行更正。<br />
			</div>
			<div class='item'>
				(二)删除您的信息<br />
				您可以通过“(一)查询、更正和补充您的信息”中列明的 方式删除您的部分信息。 如果您主动注销个人账戶，除非法律有强制性留存要求<br />
				或为达成本政策所述目的而必要保留外，我们将按照适用法律法规规定对您的个人信息进行及时删除或匿名化处理。以下情形中，您也可以通过与客服向我们提出删除个人信息的请求： <br />
				1、如果我们处理个人信息的行为违反法律法规； <br />
				2、如果我们收集、使用您的个人信息，却未征得您的明确同意； <br />
				3、如果我们处理个人信息的行为严重违反了与您的约定。若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，并要求其及时删除(除非法律法规另
				有规定，或这些主体已独立获得您的授权)。<br />
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 六、本隐私权政策如何更新 </div>
			<div class='item'>
				 1、为给您提供更好的服务以及随着{{appName}}业务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会限制您依据本隐私政策所应享有的权利。 <br />
				 2、对于重大变更，我们还会提供更为显著的通知(我们会通过包括但不限于短信、弹窗等特别提示等方式，说明隐私政策的具体变更内容)。 <br />
			</div>
			<div class="item">
				本隐私政策所指的重大变更包括但不限于：<br />
				(1)我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等； <br />
				(2)我们在所有权结构、组织架构等方面发生重大变化。 如业务调整、破产、并购、重组等引起的信息控制者变更等； <br />
				(3)个人信息共享、转让或公开披露的主要对象发生变化； <br />
				(4)您参与个人信息处理方面的权利及其行使方式发生重大变化； <br />
				(5)我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时； <br />
				(6)个人信息安全影响评估报告表明存在高风险时。<br />
			</div>
		</div>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				appName: '小程序名称',
				company: '公司名称',
				domain: 'www.domain.cn',
				addr: '公司地址'
			}
		}
	}
</script>

<style lang="scss" scoped>
	.content-box {
		font-size: 16px;
		padding: 10px;
		color: #333;
		.title {
			font-weight: 700;
			margin: 10px 0;
			color: #000;
			font-size: 18px;
		}
	
		.content {
			margin: 28px 0;
	
			.point {
				font-weight: 700;
				color: #333;
			}
	
			.item-title {
				margin: 20px 0;
				font-weight: 700;
				color: #000;
				font-size: 18px;
			}
	
			.item {
				margin: 8px 0;
			}
		}
	}
</style>
