<template>
	<view class='content-box'>
		<div class='title'>“{{appName}}”用户协议</div>
		<div class='content'>
			【审慎阅读】你在开通会员服务过程中点击同意本协议之前，应当认真阅读本协议。
			<span class='point'>
				请您务必审慎阅读、充分 理解各条款内容，特别是免除或者限制责任的条款、法 律适用和争议解决条款。免除或者限制责任的条款将以 粗体下划线标识。你应重点阅读。
			</span>
			如你对协议有任何疑 问，可向{{appName}}客服咨询。
		</div>
		<div class='content'>
			<span class='point'>
				【民事行为能力】您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。如您未满18周岁或者不具备相应的民事行为能力，
				请您在法定监护人的陪同下阅读本服务协议，并在进行注册、下单、支付等任何行为或使用“{{appName}}平台其他任何服务前，应事先征得您法定监护人的同意。
			</span>
		</div>
		<div class='content'>
			<span class='point'>
				[签约动作]当您按照注册页面引导勾选同意本协议且完 成全部注册程序后，即表示您已充分阅读、理解并接受 本协议的全部内容，
				并与“{{appName}}”平台达成一致，成为 “{{appName}}”平台的“用户”。在阅读本协议的过程中，如 果您不同意本协议或其中任何条款约定，您应立即停止 注册程序。
			</span>
		</div>
		<div class='content'>
			<div class='item-title'> 一、概述 </div>
			<div class='item'>第一条：本服务协议双方为{{company}}旗下平台“{{appName}}”(下称“{{appName}}”)与“{{appName}}”
				平台用户(下称“用户”或“您”)，本服务协议具有合同效力。</div>
			<div class='item'>
				第二条：“{{appName}}”由{{company}}实际运营和管理的，为满足消费者个人生活消费需求而建立的，
				名为{{appName}}(域名为{{domain}})的电子商务平台， 其形式包括但不限于{{appName}}微信小程序及未来可能开发产生的其他形式，本协议中或称“本平台”。
			</div>
			<div class='item'>
				第三条：由于互联网高速发展，您与“{{appName}}”签署的本服务协议列明的条款并不能完整罗列并覆盖您与“{{appName}}”所有权利与义务，现有的约定也不能保证
				完全符合未来发展的需求。因此，“{{appName}}”平台的隐私权政策及其他各类规则为本协议的补充协议，与本协议不可分割且具有同等法律效力。
				如您使用“{{appName}}“平台服务，视为您同意上述补充协议
			</div>
			<div class='item'>
				第四条：根据国家法律法规变化、运营需要或为提升服务质量的目的，“{{appName}}“将在必要的时候对上述各项协议、
				条款与规则进行修改更新，并通过在网页或移动客户端上发出公告、通知等合理、醒目的方式向您进行提前通知。
				您应当及时查阅并了解相关更新修改内容，如您不同意相关更新修改内容，可停止使用相关更新修改内容所涉及的服务，
				此情形下，变更事项对您不产生效力；如您在上述更新修改内容实施后继续使用所涉及的服务，将视为您已同意各项更新修改内容。
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 二、定义 </div>
			<div class='item'>
				第五条：“{{appName}}”的用户：用户为具备完全民事行为能力的自然人。无民事行为能力人、限制民事行为能力人不当注册为“{{appName}}”用户或超过其
				民事权利或行为能力范围从事交易的，其与“{{appName}}“之间的服务协议自始无效，“{{appName}}”一经发现，有权立即注销该账号，并追究其使用“{{appName}}”“服务"的一切法律责任。
			</div>
			<div class='item'>
				第六条：用户注册是指用户登录“{{appName}}“平台，并按要求填写相关信息并确认同意履行相关服务协议的过程。用户因进行交易，获取订购商品的有偿服务或硬件、软 件、
				服务及其他方面的费用均由用户负责支付。“{{appName}}“平台仅作为网上订购的交易平台。
			</div>
			<div class='item'>
				第七条：个人信息：以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
			</div>
			<div class='item'>
				第八条：个人敏感信息：指包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下(含)儿童信息等个
				人信息，本隐私权政策中个人敏感信息将以粗体进行显著标识
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 三、权利和义务 </div>
			<div class='item'>
				第九条：用户的权利：用户有权拥有其在{{appName}}的账户，并有权使用自己的手机号码随时登录{{appName}}。用户不得以任何形式转让或授权他人使用自己的{{appName}}用户名，
				否则由此产生的一切后果由用户自行承担。用户有权根据本协议的规定以及{{appName}}上发布的相关规则在{{appName}}上查询商品信息、发表使用体验、参与商品讨论、邀请关
				注好友、合法上传商品图片、发表社区言论等参加{{appName}}的有关活动，以及有权享受{{appName}}提供的其它的有关信息服务。
			</div>
			<div class='item'>
				第十条：用户的义务：用户应当保证在使用{{appName}}购买商品过程中遵守诚实信用原则，不在购买过程中采取不正当行为，不扰乱平台上交易的正常秩序。用户不得在
				{{appName}}发表包含以下内容的言论，否则{{appName}}有权随时删除相关言论： <br />
				(1)煽动、抗拒、破坏宪法和法律、行政法规实施的；<br />
				(2)煽动颠覆国家政权，推翻社会主义制度的； <br />
				(3)煽动、分裂国家，破坏国家统一的； <br />
				(4)煽动民族仇恨、民族歧视，破坏民族团结的； <br />
				(5)任何包含对种族、性别、宗教、地域内容等歧视 的； <br />
				(6)捏造或者歪曲事实，散布谣言，扰乱社会秩序的； <br />
				(7)宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的； <br />
				(8)公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的； <br />
				(9)损害国家机关信誉的； <br />
				(10)其他违反宪法和法律行政法规的。用户在发表使用体验、讨论图片等，除遵守本条款外还应遵守美乘的相关规定。未经我们同意，用户不得在网站发布任何
				形式的广告。否则，我们有权随时予以删除。<br />
			</div>
			<div class='item'>
				第十一条：“{{appName}}”的权利和义务，{{appName}}有义务在现有技术上维护整个交易平台的正常运行，并努力提升和改进技术，使用户在平台上交易活动得以顺利进
				行。对用户在注册使用{{appName}}交易平台中所遇到的与交易或注册有关的问题及反映的情况， {{appName}}将及时作出回复。对于用户在{{appName}}上的不当行为或
				其它任何{{appName}}认为应当终止服务的情况，{{appName}}有权随时作出删除相关信息、终止提供服务等 处理，而无须征得用户的同意。
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 四、隐私权政策 </div>
			<div class='item'>
				第十二条：“{{appName}}”非常重视用户个人信息的保护，
				<span class='point'>
					根据有关法律法规要求，网络产品、服务具有收集用户信息功能的，其提供者应当向用户明示并取得同意。“{{appName}}”
					特此通过单独明示的《隐私权政策》明确向您告知收集、使用用户个人信息的目的、方式和范围，查询、更正信息的渠道以及拒绝提供信息的后果。“{{appName}}”希望通过
					隐私权政策向您清楚地介绍“{{appName}}” 对您个人信息的处理方式，因此“{{appName}}”建议您完整地阅读《隐私权政策》，以帮助您更好地保护您的隐私权。
				</span>
			</div>
		</div>
		<div class='content'>
			<div class='item-title'>五、用户违约及处理</div>
			<div class='item'>
				第十三条：发生如下情形之一的，视为您违约：<br />
				(一)使用我方平台服务时违反有关法律法规规定的。 <br />
				(二)违反本协议或本协议补充协议约定的。 <br />
				为适应互联网行业发展和满足海量用户对高效优质服务的需求，您理解并同意，
				<span class='point'>
					“{{appName}}”可在“{{appName}}”平台规则中约定违约认定的程序和标准。如：“{{appName}}” 可依据您
					的用户数据与海量用户数据的关系来认定您是否构成违约：您有权利对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。
				</span>
			</div>
			<div class='item'>
				第十四条：违约处理措施<br />
				(一)您在“{{appName}}”平台上发布的内容和信息构成违约的，“{{appName}}”平台有权根据相应规则立即对相应内容和信息进行删除、屏蔽等处理或对您的账号进行暂停使
				用、查封、注销等处理。我方平台在法律有明确规定的情况下承担相应的责任。<br />
				(二)您在“{{appName}}”平台上实施的行为，或虽未在“{{appName}}”平台上实施但对“{{appName}}”平台及其用户产生影响的行为构成违约的，“{{appName}}”可依据相应规则对您的
				账号执行限制参加活动、中止向您提供部分或全部服务等处理措施。如您的行为构成根本违约的，“{{appName}}” 可查封您的账号，终止向您提供服务。<br />
				(三)如果您在“{{appName}}”平台上的行为违反相关的法律法规，“{{appName}}”可依法向相关主管机关报告并提交您的使用记录和其他信息。<br />
			</div>
			<div class='item'>
				第十五条：
				<span class='point'>
					如您的行为使“{{appName}}”及/或其关联公司遭受损失(包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失)，
					您应赔偿“{{appName}}”及/或其关联公司的上述全部损失。如您的行为使“{{appName}}”及/或其关联公司遭受第三人主张权利，“{{appName}}”及/或其关联公司可在对第三人
					承担金钱给付等义务后就全部损失向您追偿
				</span>
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 六、协议的终止 </div>
			<div class='item'>
				第十六条：用户有权通过以下任一方式终止本协议：<br />
				(一)在满足"{{appName}}”平台公示的账号注销条件时您通 过“{{appName}}”平台注销您的账号的； <br />
				(二)变更事项生效前您停止使用并明示不愿接受变更事项的； <br />
				(三)您明示不愿继续使用“{{appName}}“平台服务，且符合 “{{appName}}”平台终止条件的。<br />
			</div>
			<div class='item'>
				第十七条：出现以下情况时，“{{appName}}”可以通知您终止本协议：<br />
				(一)您违反本协议约定，“{{appName}}“依据违约条款终止本协 <br />
				(二)您盗用他人账号、发布违禁信息、骗取他人财物、扰乱市场秩序、采取不正当手段谋利等行为，“{{appName}}”依据“{{appName}}”平台规则对
				您的账号予以查封的；<br />
				(三)除上述情形外，因您多次违反“{{appName}}“平台规则相关规定且情节严重，“{{appName}}”依据“{{appName}}“平台规则对您的账号予以查封的；
				(四)您的账号被“{{appName}}“依据本协议进行注销等清理的；<br />
				(五)您在“{{appName}}“平台有侵犯他人合法权益或其他严重违法违约行为的； <br />
				(六)其它根据相关法律法规“{{appName}}“应当终止服务的情况。<br />
			</div>
			<div class='item'>
				第十八条：
				<span class="point">
					本协议终止后，除法律有明确规定外，原则 上，“{{appName}}”无义务向您或您指定的第三方披露您账号中的任何信息。
				</span>
			</div>
			<div class='item'>
				第十九条：本协议终止后，“{{appName}}“仍享有下列权利：<br />
				(一)“{{appName}}”可根据适用法律的要求删除您的个人信息，或使其匿名化处理。也可依照法律规定的期限和方式继续保存您留存于“{{appName}}“平台的其他内容和信息。<br />
				(二)对于您过往的违约行为，“{{appName}}“仍可依据本协议向您追究违约责任。<br />
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 七、责任范围 </div>
			<div class='item'>
				第二十条：
				<span class="point">
					“{{appName}}”依照法律规定履行基础保障义务，但对于下述原因导致的协议履行障碍、履行瑕疵 履行延后或履行内容变更等情形，
					“{{appName}}”并不承担相应的违约责任： <br />
					(一)因自然灾害、罢工、暴乱、战争、政府行为、司法 行政命令等不可抗力因素； <br />
					(二)因电力供应故障、通讯网络故障等公共服务因素或第三人因素；<br />
					(三)在“{{appName}}“已尽善意管理的情况下，因常规或紧急的，设备与系统维护、设备与系统故障、网络信息与数据安全等因素；<br />
				</span>
			</div>
		</div>
		<div class='content'>
			<div class='item-title'> 八、附则 </div>
			<div class='item'>
				第二十一条：
				<span class="point">
					本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律：如法律无相关规定的，参照商业惯例或行业惯例。
				</span>
			</div>
			<div class='item'>
				第二十二条：
				<span class="point">
					您因使用“{{appName}}”平台服务所产生及与 “{{appName}}”平台服务有关的争议，由“{{appName}}”与您协商解决。协商不成时，任何一方均可向被告所在
					地人民法院提起诉讼。本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
				</span>
			</div>
			<div class='item'>
				第二十三条： 如您对本服务协议有任何问题或建议，可通过“{{appName}}”客服与我们取得联系。
			</div>
			<div class='item'>
				第二十四条：
				<span class="point">
					因本协议所产生的争议，由{{appName}}与你共同协商解决。协商不成时，任何一方均可向协议签订地的人名法院提起诉讼，本协议的签订地为{{addr}}。
				</span>
			</div>
		</div>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				appName: '小程序名称',
				company: '公司名称',
				domain: 'www.domain.cn',
				addr: '公司地址'
			}
		}
	}
</script>

<style lang="scss" scoped>
	.content-box {
		font-size: 16px;
		padding: 10px;
		color: #333;
		.title {
			font-weight: 700;
			margin: 10px 0;
			color: #000;
			font-size: 18px;
		}
	
		.content {
			margin: 28px 0;
	
			.point {
				font-weight: 700;
				color: #333;
			}
	
			.item-title {
				margin: 20px 0;
				font-weight: 700;
				color: #000;
				font-size: 18px;
			}
	
			.item {
				margin: 8px 0;
			}
		}
	}
</style>
