
/**
 * 文章分类
 * 控制文章分类字典值
*/
export enum DC0001 {
    '未分类' = 'DC00010001',
    '通知公告' = 'DC00010002',
    
}
/**
 * 广告位置
 * 小程序广告位置
*/
export enum DC0002 {
    '默认位置' = 'DC00020001',
    
}
/**
 * 短信参数设置
 * 
*/
export enum DC0003 {
    'accessKeyId' = 'DC00030001',
    '短信签名' = 'DC00030002',
    '是否启用' = 'DC00030003',
    
}
/**
 * 小程序参数设置
 * 
*/
export enum DC0004 {
    'appID' = 'DC00040001',
    'appSecret' = 'DC00040002',
    
}
/**
 * 支付参数设置
 * 
*/
export enum DC0005 {
    '应用appid' = 'DC00050001',
    '商户号mchid' = 'DC00050002',
    'api证书' = 'DC00050003',
    'api密钥' = 'DC00050004',
    '支付回调地址' = 'DC00050005',
    '退款回调地址' = 'DC00050006',
    'APIv3密钥' = 'DC00050007',
    '系统域名' = 'DC00050008',
    
}
/**
 * 短信模板
 * 短信模板相关字典值
*/
export enum DC0006 {
    '默认模板' = 'DC00060001',
    
}
/**
 * 树型分类数据类型
 * 
*/
export enum DC0007 {
    '服务区域管理' = '2',
    '产品分类' = 'DC00070002',
    
}
/**
 * 会员等级
 * 会员等级设置
*/
export enum DC0008 {
    '游客' = 'DC00080001',
    
}
/**
 * 七牛云
 * 
*/
export enum DC0009 {
    '启用' = 'DC00090001',
    'AccessKey' = 'DC00090002',
    'SecretKey' = 'DC00090003',
    '公开空间' = 'DC00090004',
    '私有空间' = 'DC00090005',
    '私有空间域名' = 'DC00090006',
    '公开空间域名' = 'DC00090007',
    
}
/**
 * 钱包类型
 * 
*/
export enum DC0010 {
    '会员钱包' = 'DC00100001',
    
}
/**
 * 资金流向
 * 
*/
export enum DC0011 {
    '收入' = '1',
    '支出' = '-1',
    
}
/**
 * 提现类型
 * 
*/
export enum DC0012 {
    '会员提现' = 'DC00120001',
    
}
/**
 * 审核状态
 * 
*/
export enum DC0013 {
    '待审核' = '0',
    '通过' = '1',
    '拒绝' = '2',
    
}
/**
 * 微信公众号配置
 * 
*/
export enum DC0014 {
    'appid' = 'DC00140001',
    'secret' = 'DC00140002',
    
}